package com.example.historyproject.model.interactors

import com.example.historyproject.entity.YearModel

class YearInteractor {

    fun getAllYears() = arrayListOf(
        YearModel(
            years = "1601—1603 гг.",
            description = "голод в России."
        ),
        YearModel("1601 г.", "— появление в Польше Лжедмитрия I."),
        YearModel("1603 г.", "восстание Хлопка."),
        YearModel("1605 г.", "смерть Бориса Годунова."),
        YearModel("1605—1606 гг.", "правление Лжедмитрия I."),
        YearModel("1606—1610 гг.", "царствование Василия Шуйского."),
        YearModel("1606—1607 гг.", "восстание И. И. Болотникова."),
        YearModel(
            "1610 г",
            "присяга московских бояр королевичу Владиславу. Вступление поляков в Москву."
        ),
        YearModel("1611—1612 гг.", "первое и второе ополчение."),
        YearModel("1612 г.", "освобождение Москвы вторым ополчением."),
        YearModel("1613 г.", "избрание царем Михаила Федоровича Романова."),
        YearModel("1613—1645 гг.", "правление Михаила Федоровича Романова."),
        YearModel("1645—1676 гг.", "правление Алексея Михайловича."),
        YearModel("1649 г.", "принятие Соборного уложения."),
        YearModel("1653—1656 гг.", "церковная реформа."),
        YearModel("1666—1667 гг.", "Церковный собор, проклявший всех противников реформы"),
        YearModel(
            "1639 г., 1642 г.",
            "указы об увеличении срока сыска беглых крестьян до 9 лет и до 10 лет."
        ),
        YearModel("1653 г.", "принят Торговый устав"),
        YearModel("1667 г.", "принят Новоторговый устав."),
        YearModel("1678—1681 гг", "проведена податная реформа."),
        YearModel("1648 г.", "Соляной бунт."),
        YearModel("1662 г.", "Медный бунт."),
        YearModel("1632—1634 гг.", "русско-польская (Смоленская) война."),
        YearModel("1634 г.", "Поляновский мирный договор."),
        YearModel("1648 г.", "открытие С. Дежневым пролива, отделяющего Азию от Америки."),
        YearModel("1649—1653 гг.", "походы Хабарова на Амур."),
        YearModel("1654—1667 гг.", "русско-польская война."),
        YearModel(
            "1654 г.",
            "Переяславская рада, провозгласившая переход Левобережной Украины в подданство русского царя."
        ),
        YearModel("1667 г.", "Андрусовское перемирие."),
        YearModel("1677—1678 гг.", "Чигиринские походы."),
        YearModel("1681 г.", "Бахчисарайский мир."),
        YearModel("1686 г.", "подписан «вечный мир» России с Польшей."),
        YearModel("1676—1682 гг.", "правление Федора Алексеевича."),
        YearModel("1682 г.", "отмена местничества."),
        YearModel("1682—1689 гг", "регентство Софьи Алексеевны"),
        YearModel("1682—1696 гг.", "двоецарствие Ивана V и Петра I"),
        YearModel("1687 и 1689 гг.", "Крымские походы."),
        YearModel("1687 г.", "основание Славяно-греко-латинской академии."),
        YearModel("1682—1725 гг.", "правление Петра I."),
        YearModel("1695—1696 гг.", "Азовские походы."),
        YearModel("1696 г.", "установление единоличного правления Петра I."),
        YearModel("1696 г.", "начало создания русского флота."),
        YearModel("1697—1698 гг.", "Великое посольство России в Европе"),
        YearModel("1699 г.", "указ о введении нового летосчисления."),
        YearModel("1700—1721 гг.", "Северная война."),
        YearModel("1703 г.", "основание Санкт-Петербурга."),
        YearModel("1705 г.", "введение рекрутской повинности."),
        YearModel("1708 г.", "победа у Лесной."),
        YearModel("1709 г.", "Полтавская битва."),
        YearModel("1711 г.", "Прутский поход."),
        YearModel("1714 г.", "победа русского флота у мыса Гангут."),
        YearModel("1708—1710 гг.", "губернская реформа."),
        YearModel("1711 г.", "учреждение Сената."),
        YearModel("1712 г.", "указ об учреждении торгово-промышленных компаний."),
        YearModel("1714 г.", "указ о единонаследии."),
        YearModel("1718—1720 гг.", "введение коллегий."),
        YearModel("1718—1724 гг.", "податная реформа."),
        YearModel("1721 г.", "церковная реформа."),
        YearModel("1722 г.", "принятие Табели о рангах."),
        YearModel("1722 г.", "указ об объединении мастеров-ремесленников в цехи"),
        YearModel("1724 г.", "введение покровительственного таможенного тарифа")
    )
}